code/openfoam/tutorials/multiRegion/CHT/notchedRoller/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        rotating;

    solidBodyMotionFunction
    {
        type          rotatingMotion;

        origin        (0 0 0);
        axis          (0 0 1);

        omega         20 [rpm];
    }
}

// ************************************************************************* //
